In [4]:
import pandas as pd
import numpy as np

In [6]:
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [10]:
import pandas as pd
# 시리즈 만들기
a = pd.Series([1,2,8,np.nan,4,9,12])
print(a)
print(type(a))

0     1.0
1     2.0
2     8.0
3     NaN
4     4.0
5     9.0
6    12.0
dtype: float64
<class 'pandas.core.series.Series'>

In [13]:
import pandas as pd
# 인덱스명 지정하기 
t1 = pd.Series(['kim','lee','park','hong'], index=['data1','data2','data3','data4'])
print(t1)

data1     kim
data2     lee
data3    park
data4    hong
dtype: object

In [14]:
print(t1.index)
print(t1.values)

Index(['data1', 'data2', 'data3', 'data4'], dtype='object')
['kim' 'lee' 'park' 'hong']

In [15]:
print(type(t1))

<class 'pandas.core.series.Series'>

In [17]:
print(t1['data1'])

kim

In [19]:
print(t1[0])

kim

In [47]:
a= pd.Series(['a','b','c','d'], index = [i for i in np.arange(1,5)])

In [48]:
print(a)

1    a
2    b
3    c
4    d
dtype: object

In [50]:
a[1]

'a'

In [57]:
t2 = {'a1':1000, 'a2':2000, 'a3':300, 'a4':500}
print(type(t2))

<class 'dict'>

In [59]:
s2 = pd.Series(t2)
print(s2)

a1    1000
a2    2000
a3     300
a4     500
dtype: int64

In [63]:
print(s2['a1']) #인덱스이용 출력
print(s2[0]) #해당로우 번호로 출력

1000
1000

In [66]:
item = ['item1','item2','item3']
itemprice = [300,200,100]

s3 = pd.Series(itemprice, index=item)
print(s3)

item1    300
item2    200
item3    100
dtype: int64

In [68]:
print(s3.item)

<bound method IndexOpsMixin.item of item1    300
item2    200
item3    100
dtype: int64>

In [69]:
print(s3.index)

Index(['item1', 'item2', 'item3'], dtype='object')

In [70]:
print(s3.values)

[300 200 100]

In [75]:
print(s3[1:])

item2    200
item3    100
dtype: int64

In [78]:
s3

item1    300
item2    200
item3    100
dtype: int64

In [86]:
# 이름 지정하기
s3.name = 'itemprice'
s3.index.name = '<item>'

In [87]:
print(s3)

<item>
item1    300
item2    200
item3    100
Name: itemprice, dtype: int64

In [90]:
from pandas import Series # 맞바로 사용
import numpy as np

a = Series([1,2,3], index = ['a1','a2','a3'], dtype=np.float32, name ='data' )
print(a)

a1    1.0
a2    2.0
a3    3.0
Name: data, dtype: float32

In [95]:
import pandas as pd
from pandas import Series
s3 = Series([100,200,300, np.nan, 400], index =['a1','a2','a3','a4','a5'])

print(s3)
print()
print(pd.isnull(s3)) # isnull() : null 값 확인용

a1    100.0
a2    200.0
a3    300.0
a4      NaN
a5    400.0
dtype: float64

a1    False
a2    False
a3    False
a4     True
a5    False
dtype: bool

In [96]:
pd.notnull(s3) # notnull() : null 이 아닌값 확인용

a1     True
a2     True
a3     True
a4    False
a5     True
dtype: bool

In [97]:
s3.isnull()

a1    False
a2    False
a3    False
a4     True
a5    False
dtype: bool

In [98]:
s3.isna() # isnull or isna

a1    False
a2    False
a3    False
a4     True
a5    False
dtype: bool

In [101]:
# DataFrame
import pandas as pd
from pandas import Series, DataFrame

data = {'name':['hong','lee','park','kim']
       ,'age':[10,20,21,25]
       ,'addr':['서울','경기','강원','제주']
       }
data

{'name': ['hong', 'lee', 'park', 'kim'],
 'age': [10, 20, 21, 25],
 'addr': ['서울', '경기', '강원', '제주']}

In [102]:
df1 = DataFrame(data)
print(df1)
print(type(df1))

   name  age addr
0  hong   10   서울
1   lee   20   경기
2  park   21   강원
3   kim   25   제주
<class 'pandas.core.frame.DataFrame'>

In [106]:
data = (np.arange(20)*10).reshape(5,4)
index=['a1','a2','a3','a4','a5']
column =['test1','test2','test3','test4']

df2 = DataFrame(data, index = index, columns=column)
print(df2)

    test1  test2  test3  test4
a1      0     10     20     30
a2     40     50     60     70
a3     80     90    100    110
a4    120    130    140    150
a5    160    170    180    190

In [107]:
data1 = {'name':'hong', 'age':20}
data2 = {'name': 'park', 'age':10}
data3 = {'name': 'kim', 'age':5}

df4 = DataFrame([data1,data2,data3],columns=['name','age'])
print(df4)

   name  age
0  hong   20
1  park   10
2   kim    5

In [116]:
data4 =[['hong',20,np.nan]
       ,['park',35,'male']
       ,['lee',58,'female']
       ,['park',20,'male']
       ]
print('자료길이: ', len(data4))
#df5 = DataFrame(data4, index = np.arange(len(data4)), columns=['name','age','gender'])
df5 = DataFrame(data4, index = ['a'+ str(index+1) for index in np.arange(len(data4))]
                , columns=['name','age','gender'])
print(df5)

자료길이:  4
    name  age  gender
a1  hong   20     NaN
a2  park   35    male
a3   lee   58  female
a4  park   20    male

In [117]:
df5.values

array([['hong', 20, nan],
       ['park', 35, 'male'],
       ['lee', 58, 'female'],
       ['park', 20, 'male']], dtype=object)

In [118]:
df5.index

Index(['a1', 'a2', 'a3', 'a4'], dtype='object')

In [119]:
df5.columns

Index(['name', 'age', 'gender'], dtype='object')

In [121]:
df5.dtypes

name      object
age        int64
gender    object
dtype: object

In [126]:
df5['age']

a1    20
a2    35
a3    58
a4    20
Name: age, dtype: int64

In [128]:
df5.name

a1    hong
a2    park
a3     lee
a4    park
Name: name, dtype: object

In [129]:
df5.name + 'aaa'

a1    hongaaa
a2    parkaaa
a3     leeaaa
a4    parkaaa
Name: name, dtype: object

In [136]:
print(df5.age)
print()
print(df5.age *2)

a1    20
a2    35
a3    58
a4    20
Name: age, dtype: int64

a1     40
a2     70
a3    116
a4     40
Name: age, dtype: int64

In [139]:
df5.info(0)

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a1 to a4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 288.0+ bytes

In [138]:
df5.describe()

             age
count   4.000000
mean   33.250000
std    17.951323
min    20.000000
25%    20.000000
50%    27.500000
75%    40.750000
max    58.000000

In [142]:
df5

    name  age  gender
a1  hong   20     NaN
a2  park   35    male
a3   lee   58  female
a4  park   20    male

In [143]:
df5.head()

    name  age  gender
a1  hong   20     NaN
a2  park   35    male
a3   lee   58  female
a4  park   20    male

In [151]:
data=np.arange(50).reshape(25,2)

columns=['a1','a2']
index = ['data'+str(index+1) for index in np.arange(25)]

a = DataFrame(data, index=index, columns=columns)
a.head() # 위에서부터 (default)5개의 자료를 보여줌
#(가로안에 n값을 넣으면 그만큼 보여줌)

       a1  a2
data1   0   1
data2   2   3
data3   4   5
data4   6   7
data5   8   9
data6  10  11
data7  12  13

In [152]:
a.tail() # 뒤에서부터 5개의 자료를 보여줌  < =  > a.head() 차이점 확인
#head 와 마찬가지로 가로안에 n값을 넣은만큼 보여줌(default 값 : 5)

        a1  a2
data24  46  47
data25  48  49

In [161]:
# export import
import pandas as pd

data = {'name':['hong','kim','lee','park']
       ,'age':[10,20,25,15]      }
df=DataFrame(data, columns=['name', 'age'], index =['a1','a2','a3','a4'])

#to_csv
df.to_csv('./sample/hello2.csv', index = False)
print("내용 쓰기 완료")

내용 쓰기 완료

In [167]:
# pd.read_csv
df= pd.read_csv('./sample/hello2.csv', index_col=False)
print(df)

   name  age
0  hong   10
1   kim   20
2   lee   25
3  park   15

In [164]:
df.head()

   name  age
0  hong   10
1   kim   20
2   lee   25
3  park   15

In [165]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [5]:
import pandas as pd
data = pd.read_csv('./data/seoul_wifi.tsv','\t', encoding = 'utf8')
data.head()

    구명    유형                    지역명   설치위치(X좌표)  설치위치(Y좌표) 설치기관(회사)
0  강남구  공공기관           (재)서울산업통상진흥원  127.071755  37.495582     LGU+
1  강남구  공공기관  (재)서울산업통상진흥원서울신기술창업센타  127.038054  37.497612     LGU+
2  강남구  공공기관              U강남도시관제센터  127.040992  37.508403      강남구
3  강남구  공공기관                  강남구의회  127.064203  37.493938      강남구
4  강남구  공공기관                   강남구청  127.047502  37.517305      강남구

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2994 entries, 0 to 2993
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   구명         2994 non-null   object
 1   유형         2994 non-null   object
 2   지역명        2994 non-null   object
 3   설치위치(X좌표)  2994 non-null   float64
 4   설치위치(Y좌표)  2994 non-null   float64
 5   설치기관(회사)   2994 non-null   object
dtypes: float64(2), object(4)
memory usage: 140.5+ KB

In [ ]:
#conda list

In [7]:
d1 = data.head(10)

In [8]:
d1.to_excel('./sample/seoul.xls',sheet_name='s_wifi'
            ,index_label=False)

In [10]:
d1[2:5]

    구명    유형        지역명   설치위치(X좌표)  설치위치(Y좌표) 설치기관(회사)
2  강남구  공공기관  U강남도시관제센터  127.040992  37.508403      강남구
3  강남구  공공기관      강남구의회  127.064203  37.493938      강남구
4  강남구  공공기관       강남구청  127.047502  37.517305      강남구

In [12]:
d1['유형']

0    공공기관
1    공공기관
2    공공기관
3    공공기관
4    공공기관
5    공공기관
6    공공기관
7    공공기관
8    공공기관
9    공공기관
Name: 유형, dtype: object

In [ ]:
conda list

In [72]:
import pymysql as mysql
import pandas as pd

host = '127.0.0.1'
user = 'root'
pw = 'kita' 
db = 'employees'

conn= mysql.connect(host=host, user=user, password=pw
                    , db=db, charset='utf8'
              ,cursorclass=mysql.cursors.DictCursor)

In [73]:
df = pd.read_sql("select * from employees limit 10", conn)
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [74]:
sql ="select * from employees limit 10"

cursor = conn.cursor()
cursor.execute(sql)
data =pd.DataFrame(cursor, columns=list(zip(*cursor.description))[0])
print(data)
conn.close()

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

In [83]:
import pandas as pd
import numpy as np

In [84]:
data =[['hong',22,np.nan],['kim',35,'male']
      ,['kim',58,'female'],['park',20,'male']]
df = pd.DataFrame(data, index=['a1','a2','a3','a4'], columns=['name','age','gender'] )

In [85]:
df.head()

    name  age  gender
a1  hong   22     NaN
a2   kim   35    male
a3   kim   58  female
a4  park   20    male

In [86]:
print(df[['name']])
print(df[['name','age']])

    name
a1  hong
a2   kim
a3   kim
a4  park
    name  age
a1  hong   22
a2   kim   35
a3   kim   58
a4  park   20

In [87]:
df.loc[:, 'name']

a1    hong
a2     kim
a3     kim
a4    park
Name: name, dtype: object

In [88]:
df.loc[:,['name','age']]

    name  age
a1  hong   22
a2   kim   35
a3   kim   58
a4  park   20

In [89]:
df[0:4]

    name  age  gender
a1  hong   22     NaN
a2   kim   35    male
a3   kim   58  female
a4  park   20    male

In [90]:
df[['name','age']]

    name  age
a1  hong   22
a2   kim   35
a3   kim   58
a4  park   20

In [91]:
df.loc[:,'name']

a1    hong
a2     kim
a3     kim
a4    park
Name: name, dtype: object

In [92]:
df.loc[:, ['name','age']]

    name  age
a1  hong   22
a2   kim   35
a3   kim   58
a4  park   20

In [93]:
df.iloc[1:3,0:2]

   name  age
a2  kim   35
a3  kim   58

In [94]:
df.loc['a2']

name       kim
age         35
gender    male
Name: a2, dtype: object

In [95]:
df.loc[['a1','a2']]

    name  age gender
a1  hong   22    NaN
a2   kim   35   male

In [96]:
df.loc[:,'age']

a1    22
a2    35
a3    58
a4    20
Name: age, dtype: int64

In [100]:
df.loc[['a1','a2'],['name','age','gender']]

    name  age gender
a1  hong   22    NaN
a2   kim   35   male

In [101]:
df

    name  age  gender
a1  hong   22     NaN
a2   kim   35    male
a3   kim   58  female
a4  park   20    male

In [107]:
df.iloc[0:2,1:2]

    age
a1   22
a2   35